### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).

### Three observable trends in this dataset:

* 1. Players in their early 20's spend the most, by far, on in-game items.
* 2. Players between the ages of 15-19 spend a considerable amount of money, even though they are likely to be unemployed or have entry-level jobs, making them a valuable target to market items to.
* 3. Women only account for a small percentage of the playerbase, but make larger purchases on average. If there were more women playing the game, they would likely spend the same amount or more than men overall.
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
5,5,Yalae81,22,Male,81,Dreamkiss,3.61
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67
8,8,Undjask33,22,Male,21,Souleater,1.10
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58

## Player Count

* Display the total number of players

In [2]:
pc_df = pd.DataFrame(purchase_data['SN']).nunique().to_frame('Total Players').reset_index(drop=True)
pc_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
u_items = purchase_data.groupby("Item Name")["Item Name"].nunique()
u_items = u_items.count()
u_items

179

In [4]:
avg_price = purchase_data['Price'].mean()
avg_price = '${:,.2f}'.format(avg_price)
avg_price

'$3.05'

In [5]:
tot_purch = len(purchase_data)
tot_purch

780

In [6]:
tot_rev = purchase_data["Price"].sum()
tot_rev = '${:,.2f}'.format(tot_rev)
tot_rev

'$2,379.77'

In [7]:
pa_df = pd.DataFrame({"Number of Unique Items":[u_items], "Average Price":[avg_price], "Number of Purchases":[tot_purch], "Total Revenue":[tot_rev]})
pa_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
gen_ct = purchase_data.groupby("Gender")["SN"].nunique()
num_tot = gen_ct.sum()

In [9]:
gen_pct = (gen_ct/num_tot)*100
gen_pct = gen_pct.round(2)
gen_pct

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [10]:
gen_dem = pd.DataFrame({"Total Count": gen_ct,"Percentage of Players":gen_pct})
gen_dem

                       Total Count  Percentage of Players
Gender
Female                          81                  14.06
Male                           484                  84.03
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
gen_purch = purchase_data.groupby("Gender")["Item Name"]
gen_purch = gen_purch.count()
gen_purch

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [12]:
gen_avg = purchase_data.groupby("Gender")["Price"].mean()
gen_avg = gen_avg.round(2)
gen_avg

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [13]:
gen_totval = purchase_data.groupby("Gender")["Price"].sum()
gen_totval

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [14]:
gen_avg_ind = (gen_totval/gen_ct).round(2)
gen_avg_ind

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [15]:
purch_analysis = pd.DataFrame({"Purchase Count":gen_purch, "Average Purchase Price":gen_avg, "Total Purchase Value":gen_totval, "Avg Total Purchase per Person":gen_avg_ind})
purch_analysis['Average Purchase Price'] = ['${:,.2f}'.format(x) for x in purch_analysis['Average Purchase Price']]
purch_analysis['Total Purchase Value'] = ['${:,.2f}'.format(x) for x in purch_analysis['Total Purchase Value']]
purch_analysis['Avg Total Purchase per Person'] = ['${:,.2f}'.format(x) for x in purch_analysis['Avg Total Purchase per Person']]
purch_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [16]:
ages = [0, 9, 14, 19, 24, 29, 34, 39, 45]
age_ranges = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [17]:
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], ages, labels=age_ranges)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [18]:
age_demo_test = pd.DataFrame(purchase_data["SN"])
age_demo_test['Gender'] = purchase_data["Gender"]
age_demo_test['Age Range'] = purchase_data["Age Range"]
age_demo_test['Age'] = purchase_data["Age"]
age_demo_test = age_demo_test.drop_duplicates(subset='SN', keep="first")
age_demo_test.head()

              SN Gender Age Range  Age
0        Lisim78   Male     20-24   20
1    Lisovynya38   Male       40+   40
2     Ithergue48   Male     20-24   24
3  Chamassasya86   Male     20-24   24
4      Iskosia90   Male     20-24   23

In [19]:
age_demo_totals = age_demo_test["Age Range"].value_counts()
age_demo_pct = age_demo_totals / num_tot * 100
age_demo_df = pd.DataFrame({"Total Count": age_demo_totals, "Percentage of Players": age_demo_pct})
age_demo_df = age_demo_df.style.format({'Percentage of Players': '{:.2f}'})
age_demo_df

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [20]:
ages_pa = [0, 9, 14, 19, 24, 29, 34, 39, 45]
age_ranges_pa = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [21]:
age_pur_ct = purchase_data.groupby("Age Range")["Item Name"]
age_pur_ct = age_pur_ct.count()
age_pur_ct

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Item Name, dtype: int64

In [22]:
age_pur_price = purchase_data.groupby("Age Range")["Price"].mean()
age_pur_price = age_pur_price.round(2)
age_pur_price

Age Range
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [23]:
age_pur_value = purchase_data.groupby("Age Range")["Price"].sum()
age_pur_value

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [24]:
age_pur_totalavg = age_pur_value / age_pur_ct
age_pur_totalavg = age_pur_totalavg.round(2)
age_pur_totalavg

Age Range
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
dtype: float64

In [25]:
age_pur_df = pd.DataFrame({"Purchase Count": age_pur_ct, "Average Purchase Price": age_pur_price, "Total Purchase Value": age_pur_value, "Avg Total Purchase per Person": age_pur_totalavg})
del age_pur_df.index.name

#formatting
age_pur_df["Average Purchase Price"] = age_pur_df["Average Purchase Price"].map("${:,.2f}".format)
age_pur_df["Total Purchase Value"] = age_pur_df["Total Purchase Value"].map("${:,.2f}".format)
age_pur_df["Avg Total Purchase per Person"] = age_pur_df["Avg Total Purchase per Person"].map("${:,.2f}".format)
age_pur_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$3.35
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,"$1,114.06",$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [26]:
users_price = purchase_data.groupby(["SN"])['Price'].sum()
users_purchases = purchase_data.groupby(["SN"])['Price'].count()
users_sn = purchase_data.groupby(["SN"])
avg_purchase_price = round(users_price/users_purchases,2)

top_spenders = pd.DataFrame({"Purchase Count": users_purchases, "Average Purchase Price": avg_purchase_price, "Total Purchase Value": users_price})
top_spenders = top_spenders.sort_values("Total Purchase Value", ascending=False)
top_spenders = top_spenders[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]

#formatting
top_spenders["Average Purchase Price"] = top_spenders["Average Purchase Price"].map("${:,.2f}".format)
top_spenders["Total Purchase Value"] = top_spenders["Total Purchase Value"].map("${:,.2f}".format)

top_spenders.reset_index(inplace=False)
top_spenders.round(2)
top_spenders.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [27]:
item_id = purchase_data.groupby('Item ID')
item_group = pd.DataFrame(item_id['Item ID'].count())
item_group.rename(columns = {"Item ID": "Purchase Count"}, inplace = True)
tot_purch_val = pd.DataFrame(item_id['Price'].sum())
tot_purch_val.rename(columns = {"Price": "Total Purchase Value"}, inplace =True)
no_duplicate_items = purchase_data.drop_duplicates('Item ID')
top_five = no_duplicate_items.merge(item_group, left_on = "Item ID", right_index = True)
top_five = top_five.merge(tot_purch_val, left_on = "Item ID", right_index = True)
top_five = top_five[['Item ID', "Item Name", "Price", "Purchase Count", "Total Purchase Value"]]
top_five.sort_values("Purchase Count", ascending = False, inplace = True)
top_five = top_five.iloc[0:5][:]

#formatting
top_five["Price"] = top_five["Price"].map("${:,.2f}".format)
top_five["Total Purchase Value"] = top_five["Total Purchase Value"].map("${:,.2f}".format)
top_five.set_index(['Item ID'], inplace=True)
top_five

,Item Name,Price,Purchase Count,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,12,$50.76
108,"Extraction, Quickblade Of Trembling Hands",$3.53,9,$31.77
82,Nirvana,$4.90,9,$44.10
145,Fiery Glass Crusader,$4.58,9,$41.22
19,"Pursuit, Cudgel of Necromancy",$1.02,8,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [28]:
prof_items = no_duplicate_items.merge(item_group, left_on = "Item ID", right_index = True)
prof_items = prof_items.merge(tot_purch_val, left_on = "Item ID", right_index = True)
prof_items = prof_items[['Item ID', "Item Name", "Purchase Count", "Price", "Total Purchase Value"]]
prof_items.sort_values("Total Purchase Value", ascending = False, inplace = True)
#formatting
prof_items["Price"] = prof_items["Price"].map("${:,.2f}".format)
prof_items["Total Purchase Value"] = prof_items["Total Purchase Value"].map("${:,.2f}".format)
prof_items.set_index(['Item ID'], inplace=True)
prof_items.head()

,Item Name,Purchase Count,Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80